tap "thoughtbot/formulae"
tap "universal-ctags/universal-ctags"
tap "caskroom/cask"

# OS
brew "autojump"
brew "bash"
brew "cmake"
brew "diff-so-fancy"
brew "fzf"
brew "git"
brew "neovim"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "the_silver_searcher"
brew "tmux"
brew "universal-ctags", args: ["HEAD"]
brew "watchman"
brew "zsh"
cask "qlmarkdown"
cask "qlstephen"

# Utilities
brew "bat"
brew "cloc"
brew "fd"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "pandoc"
brew "qt5"
brew "shellcheck"
brew "ssh-copy-id"
brew "tree"

# Programming language prerequisites and package managers
brew "coreutils"
brew "libyaml" # should come after openssl"
brew "yarn"
cask "gpg-suite"

# Databases
brew "postgresql"
brew "redis"
