tap "homebrew/cask-fonts"

# OS
brew "autojump"
brew "bash"
brew "cmake"
brew "eza"
brew "git-delta"
brew "fzf"
brew "git"
brew "mise"
brew "neovim"
brew "openssl"
brew "rcm"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rga" # ripgrep-all
brew "tmux"
brew "watchman"
brew "zsh"
cask "qlmarkdown"
cask "qlstephen"
cask "font-hack-nerd-font"

# Utilities
brew "awscli"
brew "bat"
brew "cloc"
brew "fd"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jq"
brew "pandoc"
brew "qt5"
brew "shellcheck"
brew "ssh-copy-id"
brew "tree"

# Programming language prerequisites and package managers
brew "coreutils"
brew "libyaml" # should come after openssl"
cask "gpg-suite"

# Databases
brew "postgresql"
brew "redis"
